results/test_maximum_read_iops/fio-100g-15.log
Starting FIO benchmark on pod 15...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randread
#rwmixread=70
bs=4k
---
simple: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=76: Tue Mar 17 10:12:56 2026
  read: IOPS=35.2k, BW=138MiB/s (144MB/s)(80.6GiB/600004msec)
    slat (nsec): min=1475, max=776092, avg=11118.32, stdev=5631.38
    clat (usec): min=348, max=97910, avg=3622.88, stdev=1715.34
     lat (usec): min=357, max=97926, avg=3633.99, stdev=1715.16
    clat percentiles (usec):
     |  1.00th=[ 1237],  5.00th=[ 1647], 10.00th=[ 1909], 20.00th=[ 2245],
     | 30.00th=[ 2507], 40.00th=[ 2802], 50.00th=[ 3195], 60.00th=[ 3654],
     | 70.00th=[ 4228], 80.00th=[ 4883], 90.00th=[ 5932], 95.00th=[ 6915],
     | 99.00th=[ 8979], 99.50th=[ 9896], 99.90th=[11994], 99.95th=[12911],
     | 99.99th=[16319]
   bw (  KiB/s): min=97096, max=266384, per=100.00%, avg=140865.63, stdev=2722.69, samples=9600
   iops        : min=24274, max=66596, avg=35216.06, stdev=680.67, samples=9600
  lat (usec)   : 500=0.01%, 750=0.03%, 1000=0.23%
  lat (msec)   : 2=12.08%, 4=54.13%, 10=33.06%, 20=0.47%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=1.82%, sys=7.32%, ctx=16362673, majf=0, minf=466
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=21125314,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=138MiB/s (144MB/s), 138MiB/s-138MiB/s (144MB/s-144MB/s), io=80.6GiB (86.5GB), run=600004-600004msec
FIO benchmark completed on pod 15