results/test_maximum_read_iops/fio-100g-5.log
Starting FIO benchmark on pod 5...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randread
#rwmixread=70
bs=4k
---
simple: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=75: Tue Mar 17 10:12:05 2026
  read: IOPS=35.8k, BW=140MiB/s (147MB/s)(82.0GiB/600007msec)
    slat (nsec): min=1324, max=1170.4k, avg=12049.34, stdev=6714.82
    clat (usec): min=602, max=78732, avg=3557.47, stdev=1505.17
     lat (usec): min=611, max=78743, avg=3569.52, stdev=1505.63
    clat percentiles (usec):
     |  1.00th=[ 1549],  5.00th=[ 1876], 10.00th=[ 2073], 20.00th=[ 2343],
     | 30.00th=[ 2573], 40.00th=[ 2868], 50.00th=[ 3195], 60.00th=[ 3589],
     | 70.00th=[ 4047], 80.00th=[ 4621], 90.00th=[ 5538], 95.00th=[ 6390],
     | 99.00th=[ 8455], 99.50th=[ 9372], 99.90th=[11469], 99.95th=[12387],
     | 99.99th=[15926]
   bw (  KiB/s): min=96648, max=157840, per=100.00%, avg=143403.57, stdev=399.30, samples=9600
   iops        : min=24162, max=39460, avg=35850.53, stdev=99.83, samples=9600
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=8.05%, 4=61.09%, 10=30.54%, 20=0.31%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=1.99%, sys=8.26%, ctx=16860085, majf=0, minf=331
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=21505701,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=140MiB/s (147MB/s), 140MiB/s-140MiB/s (147MB/s-147MB/s), io=82.0GiB (88.1GB), run=600007-600007msec
FIO benchmark completed on pod 5